package 객체지향;

public class 객체지향이란 {
/*
1.정의 : 사물이나 개념들을 소프트웨어적으로 구현하고 구현된 객체들이 상호작용하여 데이터를 처리 하는 방식
    목적 : 코드의 재사용**
    객체 : 독립적으로 존재 할 수 있는 것 예) 고양이,강아지
    객체를 지향한다? : 코드를 객체화 하여 독립적으로 존재 할 수 있도록 한다

2.추상화 : 공통적인 특징을 모아둔 것 예)자동차의 기능, 건물의 형태

    상속 : 부모의 것을 자식이 받아오는 것 예) 자동차 <- 택시,버스,일반차

    캡슐화 : 사용하는 사람은 기능만 알면된다 안에 어떤 것이 있는지는 알 필요X

3.다형성 : 같은 모양을 가지고 있으나 다른 의미를 가지고 있다 예)동물의 울음소리, 타는 배, 먹는 배, 사람의 배
    메서드의 오버로딩(Over loading)
    :함수의 중복정의
    -메개변수 타입
    -메개변수 개수

    메서드의 오버라이딩(Over Riding)
    -함수의 재정의
    -부모<-자식관계 성립

*/
}
